# TP6 : STP, OSPF, bigger infra

TP oÃ¹ on avance sur des protocoles toujours trÃ¨s utilisÃ©s, mais qu'on va trouver surtout dans des gros rÃ©seaux.

On considÃ¨re que Ã§a reste des bases en admin rÃ©seau. Au menu donc :

- expÃ©rimenter STP
  - ptite topo simple avec plusieurs switches
- expÃ©rimenter OSPF
  - routage dynamique : les routeurs se partagent leurs routes
  - topo un peu plus fat
  - on en profite pour voir du DHCP Relay

> *Dans ce TP, pas de VLANs pour simplifier, et focus sur le sujet. Dans la vie rÃ©elle, les VLANs sont omniprÃ©sents.*


## Sommaire

- [TP6 : STP, OSPF, bigger infra](#tp6--stp-ospf-bigger-infra)
  - [Sommaire](#sommaire)
  - [0. Setup](#0-setup)
  - [I. STP](#i-stp)
  - [II. OSPF](#ii-ospf)
  - [III. DHCP relay](#iii-dhcp-relay)
  - [IV. Bonus](#iv-bonus)
    - [1. ACL](#1-acl)

## 0. Setup

âœ **Faites chauffer GNS**

- VM Rocky prÃªte Ã  Ãªtre clonÃ©e
- du switch et routeur Cisco, on reste sur les images des prÃ©cÃ©dents TPs

Hop petit hint en passant, on peut configurer le hostname des routeurs Cisco avec :

```cisco
R1# conf t
R1(config)# hostname meow
meow(config)# incroyable
```

âœ **Augmentez la RAM des routeurs** dans GNS, surtout celui qui est connectÃ© Ã  internet (partie II.) Ã  256M

## I. STP

On va setup STP, au sein d'une topo simple pour que vous le voyiez en action.

![Topo STP](./img/topo_stp.png)

ğŸŒ **Configurer STP sur les 3 switches**

- bon c'est surtout activÃ© par dÃ©faut en 2023
- je veux bien un `show spanning-tree`
  - y'a forcÃ©ment un port en Ã©tat *BLK* lÃ 

```bash
IOU1#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0100
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU2#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0200
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU3#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0300
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p
Et0/1               Altn BLK 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```

ğŸŒ **AltÃ©rer le spanning-tree**

- dÃ©sactiver juste un port de un switch pour provoquer la mise Ã  jour de STP

```bash
IOU1#conf t
IOU1(config)#interface Ethernet0/0
IOU1(config-if)#shutdown
IOU1(config-if)#end
*Dec  1 09:33:38.897: %LINK-5-CHANGED: Interface Ethernet0/0, changed state to administratively down
*Dec  1 09:33:39.904: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to down
```
- `show spanning-tree` pour voir la diff
```bash
IOU1#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0100
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  15  sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU2#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        200
             Port        2 (Ethernet0/1)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0200
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Root FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU3#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0300
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p
Et0/1               Altn BLK 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```

> **RÃ©-activer ce port aprÃ¨s la manip** inutile de le laisser dÃ©sactivÃ©.

```bash
IOU1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU1(config)#interface Ethernet0/0
IOU1(config-if)#no shutdown
IOU1(config-if)#
*Dec  1 10:06:51.902: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Dec  1 10:06:52.908: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to up
```
ğŸŒ **AltÃ©rer le spanning-tree** en modifiant le coÃ»t d'un lien

- modifier le coÃ»t d'un lien existant pour modifier l'arbre spanning-tree

```bash
IOU2(config)#interface Ethernet0/0
IOU2(config-if)#spanning-tree vlan 1 port-priority 16
```
```bash

IOU1#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0100
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash

IOU2#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0200
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100        16.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU3#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0300
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p
Et0/1               Altn BLK 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```

ğŸ¦ˆ **`tp6_stp.pcapng`**

- capturez du trafic STP, quelques trames
- interprÃ©tez les trames (rien dans le rendu Ã  Ã©crire, mais juste, fais l'effort de capter ce que les switches Ã©changent comme message)

[capture STP](./capture/tp6_stp.pcapng)

## II. OSPF

OSPF donc, routage dynamique.

On va se cantonner Ã  le setup de faÃ§on simple, et ensuite on mettra en place un service qui consomme ce routage en partie III.

![Topo OSPF](./img/topo_ospf.png)

> Ce sont les *areas* OSPF qui sont reprÃ©sentÃ©es en couleur, pas des rÃ©seaux. ğŸŒ¸

âœ Tableau d'adressage

- la logique de l'adressage que je vous propose :
  - choix de masque
    - du `/24` pour les rÃ©seaux oÃ¹ y'a des clients
      - classique, simple
    - du `/30` pour les rÃ©seaux entre les routeurs
      - comme Ã§a, on permet vraiment explicitement que deux IPs sur ces rÃ©seaux
  - choix des octets
    - `10.6.` pour les deux premiers octets
      - 10 pas chiant comme d'hab
      - 6 pour TP6 comme d'hab
    - pour le troisiÃ¨me octet
      - entre les routeurs : `10.6.13.` l'octet qui suit :
        - 13 indique le rÃ©seau entre le routeur 1 et le routeur 3
        - 13 et pas 31 parce que je lis de gauche Ã  droite perso
      - rÃ©seaux clients : `10.6.1.`
        - arbitraire, y'a un rÃ©seau 1, un rÃ©seau 2, etc.

| Node          | `10.6.1.0/24` | `10.6.2.0/24` | `10.6.3.0/24` | `10.6.41.0/30` | `10.6.13.0/30` | `10.6.21.0/30` | `10.6.23.0/30` | `10.6.52.0/30` |
| ------------- | ------------- | ------------- | ------------- | -------------- | -------------- | -------------- | -------------- | -------------- |
| `waf.tp6.b1`  | `10.6.1.11`   | âŒ            | âŒ            | âŒ             | âŒ             | âŒ             | âŒ             | âŒ             |
| `dhcp.tp6.b1` | `10.6.1.253`  | âŒ            | âŒ            | âŒ             | âŒ             | âŒ             | âŒ             | âŒ             |
| `meo.tp6.b1`  | âŒ            | `10.6.2.11`   | âŒ            | âŒ             | âŒ             | âŒ             | âŒ             | âŒ             |
| `john.tp6.b1` | âŒ            | âŒ            | `10.6.3.11`   | âŒ             | âŒ             | âŒ             | âŒ             | âŒ             |
| `R1`          | âŒ            | âŒ            | `10.6.3.254`  | `10.6.41.1`    | `10.6.13.1`    | `10.6.21.1`    | âŒ             | âŒ             |
| `R2`          | âŒ            | âŒ            | âŒ            | âŒ             | âŒ             | `10.6.21.2`    | `10.6.23.2`    | `10.6.52.2`    |
| `R3`          | âŒ            | âŒ            | âŒ            | âŒ             | `10.6.13.2`    | âŒ             | `10.6.23.1`    | âŒ             |
| `R4`          | `10.6.1.254`  | `10.6.2.254`  | âŒ            | `10.6.41.2`    | âŒ             | âŒ             | âŒ             | âŒ             |
| `R5`          | âŒ            | âŒ            | âŒ            | âŒ             | âŒ             | âŒ             | âŒ             | `10.6.52.1`    |

ğŸŒ **Montez la topologie**

- IP statiques sur tout le monde
  - assurez-vous que les pings passent au sein de chacun des LANs
  - au fur et Ã  mesure que vous configurez
- configuration d'un NAT sur le routeur connectÃ© Ã  internet
- **aucune route statique ne doit Ãªtre ajoutÃ©e nulle part**
- dÃ©finissez aux clients (VPCS ou VMs) des IPs statiques et dÃ©finissez leur gateway
  - ils auront toujours pas internet, car leur routeur n'a pas internet !
- aucune configuration particuliÃ¨re Ã  faire sur `dhcp.tp6.b2` pour le moment, on fera Ã§a en partie III.
  - juste une IP statique, pas de setup particulier

âœ Bref...

- IP statiques partout
- clients avec une gateway dÃ©finie
- et un NAT sur le routeur de bordurec

```bash
waf.tp6.b1> sh ip

NAME        : waf.tp6.b1[1]
IP/MASK     : 10.6.1.11/24
GATEWAY     : 10.6.1.254
DNS         :
MAC         : 00:50:79:66:68:02
LPORT       : 20004
RHOST:PORT  : 127.0.0.1:20005
MTU         : 1500

dhcp.tp6.b1> sh ip

NAME        : dhcp.tp6.b1[1]
IP/MASK     : 10.6.1.253/24
GATEWAY     : 10.6.1.254
DNS         :
MAC         : 00:50:79:66:68:03
LPORT       : 20002
RHOST:PORT  : 127.0.0.1:20003
MTU         : 1500

meo.tp6.b1> sh ip

NAME        : meo.tp6.b1[1]
IP/MASK     : 10.6.2.11/24
GATEWAY     : 10.6.2.254
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 20006
RHOST:PORT  : 127.0.0.1:20007
MTU         : 1500

john.tp6.b1> sh ip

NAME        : john.tp6.b1[1]
IP/MASK     : 10.6.3.11/24
GATEWAY     : 10.6.3.254
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 20008
RHOST:PORT  : 127.0.0.1:20009
MTU         : 1500

R1#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.21.1       YES manual up                    up
FastEthernet0/1            10.6.13.1       YES manual up                    up
FastEthernet1/0            10.6.41.1       YES manual up                    up
FastEthernet2/0            10.6.3.254      YES manual up                    up

R2#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.21.2       YES manual up                    up
FastEthernet0/1            10.6.23.2       YES manual up                    up
FastEthernet1/0            10.6.52.2       YES manual up                    up
FastEthernet2/0            unassigned      YES unset  up                    up

R3#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.13.2       YES manual up                    up
FastEthernet0/1            10.6.23.1       YES manual up                    up
FastEthernet1/0            unassigned      YES unset  up                    up
FastEthernet2/0            unassigned      YES unset  up                    up

R4#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.41.2       YES manual up                    up
FastEthernet0/1            10.6.1.254      YES manual up                    up
FastEthernet1/0            10.6.2.254      YES manual up                    up
FastEthernet2/0            unassigned      YES unset  up                    up

R5#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            192.168.122.93  YES DHCP   up                    up
FastEthernet0/1            10.6.52.1       YES manual up                    up
FastEthernet1/0            unassigned      YES unset  up                    up
FastEthernet2/0            unassigned      YES unset  up                    up

R5#ping 1.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/28/40 ms
```

On va pas ajouter toutes les routes sur tous les routeurs, ce serait une giga plaie Ã  faire, Ã  maintenir, et peu rÃ©silient.

OSPF donc.

ğŸŒ **Configurer OSPF sur tous les routeurs**

- tous les routeurs doivent partager tous les rÃ©seaux auxquels ils sont connectÃ©s
- un petit `show running-config` oÃ¹ vous enlevez ce que vous n'avez pas tapÃ© pour le rendu !
- et un `show ip ospf neighbor` + `show ip route` sur chaque routeur

> RÃ©fÃ©rez-vous [au mÃ©mo Cisco](../../../cours/memo/cisco.md) pour les commandes OSPF.

ğŸŒ **Test**

- faites des `ping` dans tous les sens
- c'est simple hein : normalement tout le monde peut ping tout le monde
- et mÃªme tout le monde a internet y compris les clients
- mettez moi quelques `ping` dans le compte-rendu

ğŸ¦ˆ **`tp6_ospf.pcapng`**

- capturez des BPDUs lÃ  oÃ¹ vous voulez
- interprÃ©tez les BPDUs

> *Un BPDU c'est juste le nom qu'on donne Ã  une trame OSPF Ã©changÃ©e entre deux routeurs.*

## III. DHCP relay

âœ **Un problÃ¨me trÃ¨s rÃ©current pour pas dire omniprÃ©sent avec DHCP c'est que Ã§a marche que dans un LAN.**

Si t'as un serveur DHCP, et plein de rÃ©seaux comme c'est le cas ici, c'est le bordel :

- un DHCP Request, qui part en broadcast ne passe pas un routeur
- en effet, pour changer de rÃ©seau, il faut construire des paquets IP
- hors quand tu fais ton DHCP Request c'est Ã§a que tu cherches : avoir une IP
- dans notre topo actuelle, impossible que John contacte le serveur DHCP

âœ **DHCP Relay !**

- on va demander Ã  un routeur, s'il reÃ§oit des trames DHCP de les faire passer vers notre serveur DHCP
- si le serveur DHCP le supporte, il rÃ©pondra donc au routeur, qui fera passer au client

ğŸŒ **Configurer un serveur DHCP** sur `dhcp.tp6.b1`

- mÃªme setup que d'habitude [(c'est ce lien que tu cherches ?)](https://www.server-world.info/en/note?os=Rocky_Linux_8&p=dhcp&f=1)
- votre serveur DHCP donne des IPs dans les rÃ©seaux
  - `10.6.1.0/24`
    - de `10.6.1.100` Ã  `10.6.1.200`
    - informe les clients de l'adresse de la passerelle de ce rÃ©seau
    - informe les clients de l'adresse d'un serveur DNS : `1.1.1.1`
  - `10.6.3.0/24`
    - de `10.6.3.100` Ã  `10.6.3.200`
    - informe les clients de l'adresse de la passerelle de ce rÃ©seau
    - informe les clients de l'adresse d'un serveur DNS : `1.1.1.1`
- pour le compte-rendu Ã§a me suffit :
  - `sudo cat /etc/dhcp/dhcpd.conf`
  - `systemctl status dhcpd`

ğŸŒ **Configurer un DHCP relay sur la passerelle de John**

- vÃ©rifier que Waf et John peuvent rÃ©cupÃ©rer une IP en DHCP
- check les logs du serveur DHCP pour voir les DORA
  - je veux ces 4 lignes de logs dans le compte-rendu
  - pour John et pour Waf
- la conf sur le routeur qui est la passerelle de John c'est :

```cisco
R1#conf t
R1(config)#interface fastEthernet 2/0 # interface qui va recevoir des requÃªtes DHCP
R1(config-if)#ip helper-address <DHCP_SERVER_IP_ADDRESS>
```

> *Ui c'est tout. Bah... quoi de plus ? Il a juste besoin de savoir Ã  qui faire passer les requÃªtes !*

## IV. Bonus

### 1. ACL

C'est un peu moche que les clients puissent `ping` les IPs des routeurs de l'autre cÃ´tÃ© de l'infra.

Normalement, il peut joindre sa passerelle, internet, Ã©puicÃ©tou.

ğŸŒ **Configurer une access-list**

- Ã§a se fait sur les routeurs
- le but :
  - les clients peuvent ping leur passerelle
  - et internet
  - Ã©puicÃ©tou
